org/topics/org_roam.org
:PROPERTIES:
:ID:       5329cb10-9f3e-4311-bc69-542775991244
:END:
#+title: org-roam
#+filetags: :org:
* Functions
- Create ID for current buffer: ~org-id-get-create~
* Articles
- 2022-08-30 ◦ [[https://renatgalimov.github.io/org-basb-code/][Emacs CODE implementation]]
  - some workflows
  - implements ~CODE~ as proposed by Tiago Forte
- 2022-08-30 ◦ [[https://www.eigenbahn.com/2021/09/15/org-roam][Graphing my External Brain with Org-Roam | Eigenbahn blog]]
- 2022-08-22 ◦ [[https://systemcrafters.net/build-a-second-brain-in-emacs/5-org-roam-hacks/][5 Org Roam Hacks for Better Productivity in Emacs - System Crafters]]
* Examples
- 2022-08-30 ◦ [[https://notes.alexkehayias.com/][Alex's Notes]]
