content/topics/org_roam.md
+++
title = "org-roam"
tags = ["org"]
draft = false
+++

## Functions {#functions}

-   Create ID for current buffer: `org-id-get-create`


## Articles {#articles}

-   2022-08-30 ◦ [Emacs CODE implementation](https://renatgalimov.github.io/org-basb-code/)
    -   some workflows
    -   implements `CODE` as proposed by Tiago Forte
-   2022-08-30 ◦ [Graphing my External Brain with Org-Roam | Eigenbahn blog](https://www.eigenbahn.com/2021/09/15/org-roam)
-   2022-08-22 ◦ [5 Org Roam Hacks for Better Productivity in Emacs - System Crafters](https://systemcrafters.net/build-a-second-brain-in-emacs/5-org-roam-hacks/)


## Examples {#examples}

-   2022-08-30 ◦ [Alex's Notes](https://notes.alexkehayias.com/)